#include<stdio.h>
#include<string.h>
int main()
{
	char s[101]={};
	char r[404]={};
	scanf("%s",s);
	int s1=strlen(s); 
	int r1=4*s1;
	for(int i=r1;;i--)//i记录第几位，用于存储模的结果的位数 
	{//要用到strlen因此不可用数字，0要用‘0’代替
	//按正序记 
		s1=strlen(s);
		r[i]=(s[s1-1]-'0')%2+'0';//求s的模：求s最后一位的模 
		//更新s  s从高位开始/2
		for(int j=0;j<s1;j++) 
		{
			if((s[j]-'0')%2==1&&j<s1-1)//模拟除法 ，有余数进到下一位 
			s[j+1]+=10;
			s[j]=(s[j]-'0')/2+'0';
		}
		//退出判断 更新后的十进制‘0’的个数与最初的十进制数长度一致 
		int z;
		for(z=0;s[z]=='0';z++);
		if(z==s1)
			break;
	}
	//跳过前导0
	int i=0;
	for(;r[i]==0;i++);
	for(;i<=r1;i++)
	printf("%c",r[i]);
	return 0;
}
//输入为一个10进制大整数（大整数大于0，不带符号，无前导0，至少1位数字，且不超过100位数字）。要求将该整数转换成二进制数，并输出。
//建议：用字符数组存储大整数。
//
//输入样例
//1234567890
//输出样例
//1001001100101100000001011010010
